// Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
// Console.WriteLine("Введите размер массива");
// int size = Convert.ToInt32(Console.ReadLine());
// int [] array = new int [size];
// for (int i = 0; i < array.Length; i++)
// {
//     array[i] = new Random().Next(-100,100);
// }
// printArray(array);
// void printArray(int[] array)
// {
//     Console.Write($"[{array[0]}");
//     for (int i = 1; i < array.Length; i++)
//         Console.Write($", {array[i]}");
//     Console.WriteLine($"]");
// }
