// Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// Console.WriteLine("Введите число a");
// int num1 = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите число b");
// int num2 = Convert.ToInt32(Console.ReadLine());
// double rez = Math.Pow (num1, num2);
// Console.WriteLine(rez);


// 2 variant
// int num_a = vvod("Введите число: ");
// int num_b = vvod("Введите степень: ");
// rezult(num_a, num_b);
// int vvod(string message)
// {
//     Console.Write(message);
//     return Convert.ToInt32(Console.ReadLine());
// }
// void rezult(int num_a, int num_b)
// {
//     int rez = 1;
//     for (int i = 1; i <= num_b; i++)
//     {
//         rez = rez * num_a;
//     }
//     Console.WriteLine(rez);
// }
